eamodio.gitlens
knisterpeter.vscode-github
ms-vsliveshare.vsliveshare
wallabyjs.quokka-vscode
coenraads.bracket-pair-colorizer
visualstudioexptteam.vscodeintellicode
mauve.terraform
ms-azuretools.vscode-docker
ritwickdey.liveserver
ms-python.python
christian-kohler.path-intellisense
ms-vscode-remote.remote-containers
yzhang.markdown-all-in-one
techer.open-in-browser
streetsidesoftware.code-spell-checker
formulahendry.auto-rename-tag
formulahendry.auto-close-tag
pnp.polacod
formulahendry.code-runner
quicktype.quicktype
wayou.vscode-todo-highlight
eg2.vscode-npm-script
chrmarti.regex
donjayamanne.githistory
amazonwebservices.aws-toolkit-vscode
vscjava.vscode-java-debug
ithildir.java-properties
redhat.vscode-xml
dotjoshjohnson.xml
balazs4.gitlab-pipeline-monitor
cstuder.gitlab-ci-validator
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
GitLab.gitlab-workflow
jasonn-porch.gitlab-mr
jyee721.gitlab-snippets
logerfo.gitlab-notifications
mindaro-dev.file-downloader
mindaro.mindaro
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode.powershell
payton-burdette.gitlab-pipeline-actions
redhat.java
redhat.vscode-yaml
rrivera.vscode-gitlab-explorer
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-maven
ms-vscode.csharp